# LoadEffectApi

| Method  | Description |
|--------|-------------|
| **AddLoadEffectAsync** | Adds a new load effect to the connection. |
| **CalculateLoadExtremesAsync** | Calculates load extremes for the connection and keeps only the critical load effects active. |
| **DeleteLoadEffectAsync** | Delete load effect loadEffectId. |
| **GetLoadEffectAsync** | Gets load impulses from the specified load effect. |
| **GetLoadEffectsAsync** | Gets all load effects defined in the specified connection. |
| **GetLoadSettingsAsync** | Get Load settings for connection in project. |
| **SetLoadSettingsAsync** | Set Load settings for connection in project. |
| **UpdateLoadEffectAsync** | Update load impulses in conLoading. |

<a id="addloadeffect"></a>
## **AddLoadEffectAsync**
> **ConLoadEffect AddLoadEffectAsync (Guid projectId, int connectionId, ConLoadEffect conLoadEffect = null)**

Adds a new load effect to the connection.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |
| **conLoadEffect** | **ConLoadEffect** | The load effect data to add. | [optional]  |

### Return type

**ConLoadEffect**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class AddLoadEffectAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.
                    var conLoadEffect = new ConLoadEffect(); // ConLoadEffect | The load effect data to add. (optional)

                    try
                    {
                        // Adds a new load effect to the connection.
                        ConLoadEffect result = await conClient.LoadEffect.AddLoadEffectAsync(projectId, connectionId, conLoadEffect);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.AddLoadEffectAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/load-effects

#### Using the AddLoadEffectWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Adds a new load effect to the connection.
    ApiResponse<ConLoadEffect> response = conClient.LoadEffect.AddLoadEffectWithHttpInfo(projectId, connectionId, conLoadEffect);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.AddLoadEffectWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **422** | Unprocessable Content |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="calculateloadextremes"></a>
## **CalculateLoadExtremesAsync**
> **List&lt;ConLoadEffect&gt; CalculateLoadExtremesAsync (Guid projectId, int connectionId)**

Calculates load extremes for the connection and keeps only the critical load effects active.

Runs the load extremes (LEX) algorithm using the project's load extremes settings, then  deactivates every load effect that does not produce any extreme. Use this to reduce the number  of load effects calculated by `Calculate` on connections that contain many load effects.  The returned list contains all load effects with their updated !:ConLoadEffect.Active flag.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |

### Return type

**List&lt;ConLoadEffect&gt;**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class CalculateLoadExtremesAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.

                    try
                    {
                        // Calculates load extremes for the connection and keeps only the critical load effects active.
                        List<ConLoadEffect> result = await conClient.LoadEffect.CalculateLoadExtremesAsync(projectId, connectionId);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.CalculateLoadExtremesAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/calculate-load-extremes

#### Using the CalculateLoadExtremesWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Calculates load extremes for the connection and keeps only the critical load effects active.
    ApiResponse<List<ConLoadEffect>> response = conClient.LoadEffect.CalculateLoadExtremesWithHttpInfo(projectId, connectionId);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.CalculateLoadExtremesWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="deleteloadeffect"></a>
## **DeleteLoadEffectAsync**
> **int DeleteLoadEffectAsync (Guid projectId, int connectionId, int loadEffectId)**

Delete load effect loadEffectId.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |
| **loadEffectId** | **int** | The ID of the load effect to delete. |  |

### Return type

**int**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class DeleteLoadEffectAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.
                    loadEffectId = 56;  // int | The ID of the load effect to delete.

                    try
                    {
                        // Delete load effect loadEffectId.
                        int result = await conClient.LoadEffect.DeleteLoadEffectAsync(projectId, connectionId, loadEffectId);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.DeleteLoadEffectAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **DELETE** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/{loadEffectId}

#### Using the DeleteLoadEffectWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Delete load effect loadEffectId.
    ApiResponse<int> response = conClient.LoadEffect.DeleteLoadEffectWithHttpInfo(projectId, connectionId, loadEffectId);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.DeleteLoadEffectWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="getloadeffect"></a>
## **GetLoadEffectAsync**
> **ConLoadEffect GetLoadEffectAsync (Guid projectId, int connectionId, int loadEffectId, bool? isPercentage = null)**

Gets load impulses from the specified load effect.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |
| **loadEffectId** | **int** | The ID of the load effect to retrieve. |  |
| **isPercentage** | **bool?** | Optional flag indicating whether to return percentage-based load effects. | [optional]  |

### Return type

**ConLoadEffect**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class GetLoadEffectAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.
                    loadEffectId = 56;  // int | The ID of the load effect to retrieve.
                    isPercentage = true;  // bool? | Optional flag indicating whether to return percentage-based load effects. (optional)

                    try
                    {
                        // Gets load impulses from the specified load effect.
                        ConLoadEffect result = await conClient.LoadEffect.GetLoadEffectAsync(projectId, connectionId, loadEffectId, isPercentage);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.GetLoadEffectAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/{loadEffectId}

#### Using the GetLoadEffectWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Gets load impulses from the specified load effect.
    ApiResponse<ConLoadEffect> response = conClient.LoadEffect.GetLoadEffectWithHttpInfo(projectId, connectionId, loadEffectId, isPercentage);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.GetLoadEffectWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="getloadeffects"></a>
## **GetLoadEffectsAsync**
> **List&lt;ConLoadEffect&gt; GetLoadEffectsAsync (Guid projectId, int connectionId, bool? isPercentage = null)**

Gets all load effects defined in the specified connection.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |
| **isPercentage** | **bool?** | Optional flag indicating whether to return percentage-based load effects. | [optional]  |

### Return type

**List&lt;ConLoadEffect&gt;**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class GetLoadEffectsAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.
                    isPercentage = true;  // bool? | Optional flag indicating whether to return percentage-based load effects. (optional)

                    try
                    {
                        // Gets all load effects defined in the specified connection.
                        List<ConLoadEffect> result = await conClient.LoadEffect.GetLoadEffectsAsync(projectId, connectionId, isPercentage);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.GetLoadEffectsAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/connections/{connectionId}/load-effects

#### Using the GetLoadEffectsWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Gets all load effects defined in the specified connection.
    ApiResponse<List<ConLoadEffect>> response = conClient.LoadEffect.GetLoadEffectsWithHttpInfo(projectId, connectionId, isPercentage);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.GetLoadEffectsWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="getloadsettings"></a>
## **GetLoadSettingsAsync**
> **ConLoadSettings GetLoadSettingsAsync (Guid projectId, int connectionId)**

Get Load settings for connection in project.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |

### Return type

**ConLoadSettings**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class GetLoadSettingsAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.

                    try
                    {
                        // Get Load settings for connection in project.
                        ConLoadSettings result = await conClient.LoadEffect.GetLoadSettingsAsync(projectId, connectionId);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.GetLoadSettingsAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/get-load-settings

#### Using the GetLoadSettingsWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Get Load settings for connection in project.
    ApiResponse<ConLoadSettings> response = conClient.LoadEffect.GetLoadSettingsWithHttpInfo(projectId, connectionId);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.GetLoadSettingsWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="setloadsettings"></a>
## **SetLoadSettingsAsync**
> **ConLoadSettings SetLoadSettingsAsync (Guid projectId, int connectionId, ConLoadSettings conLoadSettings = null)**

Set Load settings for connection in project.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |
| **conLoadSettings** | **ConLoadSettings** | The new load settings to apply. | [optional]  |

### Return type

**ConLoadSettings**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class SetLoadSettingsAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.
                    var conLoadSettings = new ConLoadSettings(); // ConLoadSettings | The new load settings to apply. (optional)

                    try
                    {
                        // Set Load settings for connection in project.
                        ConLoadSettings result = await conClient.LoadEffect.SetLoadSettingsAsync(projectId, connectionId, conLoadSettings);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.SetLoadSettingsAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/set-load-settings

#### Using the SetLoadSettingsWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Set Load settings for connection in project.
    ApiResponse<ConLoadSettings> response = conClient.LoadEffect.SetLoadSettingsWithHttpInfo(projectId, connectionId, conLoadSettings);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.SetLoadSettingsWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **422** | Unprocessable Content |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="updateloadeffect"></a>
## **UpdateLoadEffectAsync**
> **ConLoadEffect UpdateLoadEffectAsync (Guid projectId, int connectionId, ConLoadEffect conLoadEffect = null)**

Update load impulses in conLoading.

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | The unique identifier of the opened project. |  |
| **connectionId** | **int** | The ID of the connection. |  |
| **conLoadEffect** | **ConLoadEffect** | The load effect data to update. | [optional]  |

### Return type

**ConLoadEffect**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class UpdateLoadEffectAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // Open the project and get its id
                    var projData = await conClient.Project.OpenProjectAsync(ideaConFile);
                    Guid projectId = projData.ProjectId;

                    // (Required) Select parameters
                    connectionId = 56;  // int | The ID of the connection.
                    var conLoadEffect = new ConLoadEffect(); // ConLoadEffect | The load effect data to update. (optional)

                    try
                    {
                        // Update load impulses in conLoading.
                        ConLoadEffect result = await conClient.LoadEffect.UpdateLoadEffectAsync(projectId, connectionId, conLoadEffect);
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling LoadEffect.UpdateLoadEffectAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                        await conClient.Project.CloseProjectAsync(projectId);
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **PUT** /api/5/projects/{projectId}/connections/{connectionId}/load-effects

#### Using the UpdateLoadEffectWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Update load impulses in conLoading.
    ApiResponse<ConLoadEffect> response = conClient.LoadEffect.UpdateLoadEffectWithHttpInfo(projectId, connectionId, conLoadEffect);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling LoadEffectApi.UpdateLoadEffectWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **401** | Unauthorized |  -  |
| **404** | Not Found |  -  |
| **422** | Unprocessable Content |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)